RIOT-OS/RIOT/cpu/esp32/periph/usbdev.c
/*
 * Copyright (C) 2019 Koen Zandberg
 *               2022 Gunar Schorcht
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup cpu_esp32
 * @{
 *
 * @file
 * @brief   Low level USB interface functions for the ESP32 FS devices
 *
 * @author  Koen Zandberg <koen@bergzand.net>
 * @author  Gunar Schorcht <gunar@schorcht.net>
 * @}
 */

#if !defined(CPU_FAM_ESP32S2) && !defined(CPU_FAM_ESP32S3)
#error "ESP32x SoC family not supported"
#endif

#define USB_H_USER_IS_RIOT_INTERNAL

/* define macros that are used for volatile keyword in STM32 header files */
#define __I  volatile
#define __O  volatile
#define __IO volatile

#include <assert.h>
#include <stdint.h>
#include <stdlib.h>
#include <errno.h>

#include "architecture.h"
#include "bitarithm.h"
#include "cpu.h"
#include "cpu_conf.h"
#include "irq_arch.h"
#include "log.h"
#include "periph/pm.h"
#include "periph/gpio.h"
#include "periph/usbdev.h"
#include "pm_layered.h"
#include "ztimer.h"

#include "esp_err.h"
#include "esp_intr_alloc.h"
#include "esp_private/usb_phy.h"
#include "soc/soc_caps.h"
#include "usbdev_esp32.h"

/**
 * Be careful with enabling debug here. As with all timing critical systems it
 * is able to interfere with USB functionality and you might see different
 * errors than debug disabled
 */
#define ENABLE_DEBUG 0
#include "debug.h"

/* at the moment FS is support only */
#define ESP32_USB_OTG_FS_ENABLED        1

/*
 * ESP32x SoCs have:
 * - a bidirectional control endpoint EP0 IN and EP0 OUT
 * - six additional endpoints EP1 .. EP6 that can be configured as IN our OUT
 * - a maximum of five IN endpoints concurrently active at any time (including EP0 IN)
 * - all OUT endpoints share a single RX FIFO
 * - each IN endpoint has a dedicated TX FIFO
 *
 * To avoid a lot of special case handling, the maximum number of IN an OUT
 * endpoints including the control endpoint EP0 is 5.
 */
#define ESP32_USB_OTG_FS_NUM_EP         5
#define ESP32_USB_OTG_HS_NUM_EP         5

#define ESP32_USB_OTG_FS_RX_FIFO_SIZE   (128U)
#define ESP32_USB_OTG_HS_RX_FIFO_SIZE   (512U)

/* ESP32-S2 and ESP32-S3 use DWC2_CORE_REV_4_00a which corresponds to STM32 USB_OTG_CID_2x */
#define ESP32_USB_OTG_CID_2x            1

#define USBDEV_CPU_DMA_ALIGNMENT        (4)

#if defined(ESP32_USB_OTG_FS_ENABLED) && defined(ESP32_USB_OTG_HS_ENABLED)
#define _TOTAL_NUM_ENDPOINTS  (ESP32_USB_OTG_FS_NUM_EP + \
                               ESP32_USB_OTG_HS_NUM_EP)
#elif defined(ESP32_USB_OTG_FS_ENABLED)
#define _TOTAL_NUM_ENDPOINTS  (ESP32_USB_OTG_FS_NUM_EP)
#elif defined(ESP32_USB_OTG_HS_ENABLED)
#define _TOTAL_NUM_ENDPOINTS  (ESP32_USB_OTG_HS_NUM_EP)
#endif

/* Mask for the set of interrupts used */
#define ESP32_FSHS_USB_GINT_MASK    \
    (USB_OTG_GINTMSK_USBSUSPM | \
     USB_OTG_GINTMSK_WUIM     | \
     USB_OTG_GINTMSK_ENUMDNEM | \
     USB_OTG_GINTMSK_USBRST   | \
     USB_OTG_GINTMSK_OTGINT   | \
     USB_OTG_GINTMSK_IEPINT   | \
     USB_OTG_GINTMSK_OEPINT   | \
     USB_OTG_GINTMSK_RXFLVLM)

#define ESP32_PKTSTS_GONAK          0x01    /**< Rx fifo global out nak */
#define ESP32_PKTSTS_DATA_UPDT      0x02    /**< Rx fifo data update    */
#define ESP32_PKTSTS_XFER_COMP      0x03    /**< Rx fifo data complete  */
#define ESP32_PKTSTS_SETUP_COMP     0x04    /**< Rx fifo setup complete */
#define ESP32_PKTSTS_SETUP_UPDT     0x06    /**< Rx fifo setup update   */

/* Some device families (F7 and L4) forgot to define the FS device FIFO size  *
 * in their vendor headers. This define sets it to the value from the         *
 * reference manual                                                           */
#ifndef USB_OTG_FS_TOTAL_FIFO_SIZE
#define USB_OTG_FS_TOTAL_FIFO_SIZE      (1280U)
#endif

/* Some device families (F7 and L4) forgot to define the HS device FIFO size  *
 * in their vendor headers. This define sets it to the value from the         *
 * reference manual                                                           */
#ifndef USB_OTG_HS_TOTAL_FIFO_SIZE
#define USB_OTG_HS_TOTAL_FIFO_SIZE      (4096U)
#endif

/* minimum depth of an individual transmit FIFO */
#define ESP32_USB_OTG_FIFO_MIN_WORD_SIZE    (16U)
/* Offset for OUT endpoints in a shared IN/OUT endpoint bit flag register */
#define ESP32_USB_OTG_REG_EP_OUT_OFFSET      (16U)

/* Endpoint zero size values */
#define ESP32_USB_OTG_EP0_SIZE_64    (0x0)
#define ESP32_USB_OTG_EP0_SIZE_32    (0x1)
#define ESP32_USB_OTG_EP0_SIZE_16    (0x2)
#define ESP32_USB_OTG_EP0_SIZE_8     (0x3)

/* Endpoint type values */
#define ESP32_USB_OTG_EP_TYPE_CONTROL   (0x00 << USB_OTG_DOEPCTL_EPTYP_Pos)
#define ESP32_USB_OTG_EP_TYPE_ISO       (0x01 << USB_OTG_DOEPCTL_EPTYP_Pos)
#define ESP32_USB_OTG_EP_TYPE_BULK      (0x02 << USB_OTG_DOEPCTL_EPTYP_Pos)
#define ESP32_USB_OTG_EP_TYPE_INTERRUPT (0x03 << USB_OTG_DOEPCTL_EPTYP_Pos)

/**
 * @brief esp32 USB OTG peripheral device out endpoint struct
 */
typedef struct {
    usbdev_ep_t ep;     /**< Inherited usbdev endpoint struct */
    uint8_t *out_buf;   /**< Requested data output buffer */
} esp32_usb_otg_fshs_out_ep_t;

/**
 * @brief USB OTG peripheral type.
 *
 * High speed peripheral is assumed to have DMA support available.
 *
 * @warning Only one of each type is supported at the moment, it is not
 * supported to have two FS type or two HS type peripherals enabled on a
 * single MCU.
 */
typedef enum {
    ESP32_USB_OTG_FS = 0,   /**< Full speed peripheral */
    ESP32_USB_OTG_HS = 1,   /**< High speed peripheral */
} esp32_usb_otg_fshs_type_t;

/**
 * @brief esp32 USB OTG configuration
 */
typedef struct {
    uintptr_t periph;               /**< USB peripheral base address */
    esp32_usb_otg_fshs_type_t type; /**< FS or HS type */
} esp32_usb_otg_fshs_config_t;

/**
 * @brief esp32 USB OTG peripheral device context
 */
typedef struct {
    usbdev_t usbdev;                            /**< Inherited usbdev struct */
    const esp32_usb_otg_fshs_config_t *config;  /**< USB peripheral config   */
    size_t fifo_pos;                            /**< FIFO space occupied */
    usbdev_ep_t *in;                            /**< In endpoints */
    esp32_usb_otg_fshs_out_ep_t *out;           /**< Out endpoints */
    bool suspend;                               /**< Suspend status */
} esp32_usb_otg_fshs_t;

static const esp32_usb_otg_fshs_config_t esp32_usb_otg_fshs_config[] = {
    {
        .periph = USB_OTG_FS_PERIPH_BASE,
        .type = ESP32_USB_OTG_FS,
    }
};

#define USBDEV_NUMOF    ARRAY_SIZE(esp32_usb_otg_fshs_config)

/* List of instantiated USB peripherals */
static esp32_usb_otg_fshs_t _usbdevs[USBDEV_NUMOF] = { 0 };

static esp32_usb_otg_fshs_out_ep_t _out[_TOTAL_NUM_ENDPOINTS];
static usbdev_ep_t _in[_TOTAL_NUM_ENDPOINTS];

/* Forward declaration for the usb device driver */
const usbdev_driver_t driver;

static void _flush_tx_fifo(const esp32_usb_otg_fshs_config_t *conf,
                           uint8_t fifo_num);

static void isr_otg_fs(void *arg);

/*************************************************************************
* Conversion function from the base address to specific register blocks *
*************************************************************************/
static USB_OTG_GlobalTypeDef *_global_regs(
    const esp32_usb_otg_fshs_config_t *conf)
{
    return (USB_OTG_GlobalTypeDef *)(conf->periph + USB_OTG_GLOBAL_BASE);
}

static USB_OTG_DeviceTypeDef *_device_regs(
    const esp32_usb_otg_fshs_config_t *conf)
{
    return (USB_OTG_DeviceTypeDef *)(conf->periph + USB_OTG_DEVICE_BASE);
}

static USB_OTG_INEndpointTypeDef *_in_regs(
    const esp32_usb_otg_fshs_config_t *conf,
    size_t endpoint)
{
    return (USB_OTG_INEndpointTypeDef *)(conf->periph +
                                         USB_OTG_IN_ENDPOINT_BASE +
                                         USB_OTG_EP_REG_SIZE * endpoint);
}

static USB_OTG_OUTEndpointTypeDef *_out_regs(
    const esp32_usb_otg_fshs_config_t *conf,
    size_t endpoint)
{
    return (USB_OTG_OUTEndpointTypeDef *)(conf->periph +
                                          USB_OTG_OUT_ENDPOINT_BASE +
                                          USB_OTG_EP_REG_SIZE * endpoint);
}

static __I uint32_t *_rx_fifo(const esp32_usb_otg_fshs_config_t *conf)
{
    return (__I uint32_t *)(conf->periph + USB_OTG_FIFO_BASE);
}

static __O uint32_t *_tx_fifo(const esp32_usb_otg_fshs_config_t *conf,
                              size_t num)
{
    return (__O uint32_t *)(conf->periph +
                            USB_OTG_FIFO_BASE +
                            USB_OTG_FIFO_SIZE * num);
}

static __IO uint32_t *_pcgcctl_reg(const esp32_usb_otg_fshs_config_t *conf)
{
    return (__IO uint32_t *)(conf->periph + USB_OTG_PCGCCTL_BASE);
}
/* end of conversion functions */

/**
 * @brief Determine the number of available endpoints for the peripheral based
 *        on the type and the CID version
 *
 * @param config    configuration struct
 */
static size_t _max_endpoints(const esp32_usb_otg_fshs_config_t *config)
{
    return (config->type == ESP32_USB_OTG_FS) ?
           ESP32_USB_OTG_FS_NUM_EP :
           ESP32_USB_OTG_HS_NUM_EP;
}

