RIOT-OS/RIOT/cpu/esp32/periph/usbdev.c
static inline void _usb_attach(esp32_usb_otg_fshs_t *usbdev)
{
    DEBUG("usbdev: Attaching to host\n");
    /* Disable the soft disconnect feature */
    _device_regs(usbdev->config)->DCTL &= ~USB_OTG_DCTL_SDIS;
}

static inline void _usb_detach(esp32_usb_otg_fshs_t *usbdev)
{
    DEBUG("usbdev: Detaching from host\n");
    /* Enable the soft disconnect feature */
    _device_regs(usbdev->config)->DCTL |= USB_OTG_DCTL_SDIS;
}

static void _set_address(esp32_usb_otg_fshs_t *usbdev, uint8_t address)
{
    _device_regs(usbdev->config)->DCFG =
        (_device_regs(usbdev->config)->DCFG & ~(USB_OTG_DCFG_DAD_Msk)) |
        (address << USB_OTG_DCFG_DAD_Pos);
}

static usbdev_ep_t *_get_ep(esp32_usb_otg_fshs_t *usbdev, unsigned num,
                            usb_ep_dir_t dir)
{
    if (num >= ESP32_USB_OTG_FS_NUM_EP) {
        return NULL;
    }
    return dir == USB_EP_DIR_IN ? &usbdev->in[num] : &usbdev->out[num].ep;
}

#if defined(DEVELHELP) && !defined(NDEBUG)
static size_t _total_fifo_size(const esp32_usb_otg_fshs_config_t *conf)
{
    if (conf->type == ESP32_USB_OTG_FS) {
#ifdef ESP32_USB_OTG_FS_ENABLED
        return USB_OTG_FS_TOTAL_FIFO_SIZE;
#else
        return 0;
#endif  /* ESP32_USB_OTG_FS_ENABLED */
    }
    else {
#ifdef ESP32_USB_OTG_HS_ENABLED
        return USB_OTG_HS_TOTAL_FIFO_SIZE;
#else
        return 0;
#endif  /* ESP32_USB_OTG_HS_ENABLED */
    }

}
#endif /* defined(DEVELHELP) && !defined(NDEBUG) */

static void _configure_tx_fifo(esp32_usb_otg_fshs_t *usbdev, size_t num,
                               size_t len)
{
    /* TX Fifo size must be at least 16 words long and must be word aligned */
    size_t wordlen = len < (ESP32_USB_OTG_FIFO_MIN_WORD_SIZE * sizeof(uint32_t))
                     ? ESP32_USB_OTG_FIFO_MIN_WORD_SIZE
                     : (len + (sizeof(uint32_t) - 1)) / sizeof(uint32_t);

    /* Check max size */
    assert(usbdev->fifo_pos + wordlen <=
           _total_fifo_size(usbdev->config) / sizeof(uint32_t));

    /* FIFO Array starts at FIFO 1 at index 0, FIFO 0 is special and has a
     * different register (DIEPTXF0_HNPTXFSIZ) */
    _global_regs(usbdev->config)->DIEPTXF[num - 1] =
        (wordlen << USB_OTG_TX0FD_Pos) |
        (usbdev->fifo_pos);
    usbdev->fifo_pos += wordlen;
}

static void _configure_fifo(esp32_usb_otg_fshs_t *usbdev)
{
    /* TODO: cleanup, more dynamic, etc */
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;
    size_t rx_size = conf->type == ESP32_USB_OTG_FS
                     ? ESP32_USB_OTG_FS_RX_FIFO_SIZE
                     : ESP32_USB_OTG_HS_RX_FIFO_SIZE;

    _global_regs(conf)->GRXFSIZ =
        (_global_regs(conf)->GRXFSIZ & ~USB_OTG_GRXFSIZ_RXFD) |
        rx_size;
    _global_regs(conf)->DIEPTXF0_HNPTXFSIZ =
        (ESP32_USB_OTG_FIFO_MIN_WORD_SIZE << USB_OTG_TX0FD_Pos) |
        rx_size;
    usbdev->fifo_pos = (rx_size + ESP32_USB_OTG_FIFO_MIN_WORD_SIZE);
}

static usbdev_ep_t *_usbdev_new_ep(usbdev_t *dev, usb_ep_type_t type,
                                   usb_ep_dir_t dir, size_t len)
{
    esp32_usb_otg_fshs_t *usbdev = (esp32_usb_otg_fshs_t *)dev;
    usbdev_ep_t *ep = NULL;

    if (type == USB_EP_TYPE_CONTROL) {
        if (dir == USB_EP_DIR_IN) {
            ep = &usbdev->in[0];
        }
        else {
            ep = &usbdev->out[0].ep;
        }
        ep->num = 0;
    }
    else {
        /* Find the first unassigned ep with matching direction */
        for (unsigned idx = 1; idx < ESP32_USB_OTG_FS_NUM_EP && !ep; idx++) {
            usbdev_ep_t *candidate_ep = _get_ep(usbdev, idx, dir);
            if (candidate_ep->type == USB_EP_TYPE_NONE) {
                ep = candidate_ep;
                ep->num = idx;
            }
        }
    }

    if (ep && ep->type == USB_EP_TYPE_NONE) {
        ep->dir = dir;
        ep->type = type;
        ep->dev = dev;
        ep->len = len;
        if (ep->dir == USB_EP_DIR_IN && ep->num != 0) {
            _configure_tx_fifo(usbdev, ep->num, ep->len);
        }
    }
    return ep;
}

/**
 * @brief reset a TX fifo.
 *
 * @param   conf        usbdev context
 * @param   fifo_num    fifo number to reset, 0x10 for all fifos
 */
static void _flush_tx_fifo(const esp32_usb_otg_fshs_config_t *conf,
                           uint8_t fifo_num)
{
    uint32_t reg = _global_regs(conf)->GRSTCTL & ~(USB_OTG_GRSTCTL_TXFNUM);

    reg |= fifo_num << USB_OTG_GRSTCTL_TXFNUM_Pos | USB_OTG_GRSTCTL_TXFFLSH;
    _global_regs(conf)->GRSTCTL = reg;
    /* Wait for flush to finish */
    while (_global_regs(conf)->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) {}
}

static void _flush_rx_fifo(const esp32_usb_otg_fshs_config_t *conf)
{
    _global_regs(conf)->GRSTCTL |= USB_OTG_GRSTCTL_RXFFLSH;
    while (_global_regs(conf)->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) {}
}

static void _sleep_periph(const esp32_usb_otg_fshs_config_t *conf)
{
    (void)conf;
#if 1
    *_pcgcctl_reg(conf) |= USB_OTG_PCGCCTL_STOPCLK;
    DEBUG("usbdev: _sleep_periph %08x\n", *_pcgcctl_reg(conf));
#ifdef ESP32_USB_OTG_CID_1x
    pm_unblock(ESP32_PM_STOP);
#endif
#endif
}

static void _wake_periph(const esp32_usb_otg_fshs_config_t *conf)
{
#if 1
#ifdef ESP32_USB_OTG_CID_1x
    pm_block(ESP32_PM_STOP);
#endif
    *_pcgcctl_reg(conf) &= ~USB_OTG_PCGCCTL_STOPCLK;
#endif
    DEBUG("usbdev: _wake_periph %08x\n", *_pcgcctl_reg(conf));
    _flush_rx_fifo(conf);
    _flush_tx_fifo(conf, 0x10);
}

static void _reset_eps(esp32_usb_otg_fshs_t *usbdev)
{
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;

    /* Set the NAK for all endpoints */
    for (size_t i = 0; i < _max_endpoints(conf); i++) {
        _out_regs(conf, i)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
        _in_regs(conf, i)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
        _in_regs(conf, i)->DIEPCTL |= (i) << USB_OTG_DIEPCTL_TXFNUM_Pos;
    }
}

static void _reset_periph(esp32_usb_otg_fshs_t *usbdev)
{
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;

    /* Wait for AHB idle */
    while (!(_global_regs(conf)->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL)) {}
    _global_regs(conf)->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
    /* Wait for reset done */
    while (_global_regs(conf)->GRSTCTL & USB_OTG_GRSTCTL_CSRST) {}
}

static void _set_mode_device(esp32_usb_otg_fshs_t *usbdev)
{
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;

    /* Force device mode */
    _global_regs(conf)->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;
    /* Spinlock to prevent a context switch here, needs a delay of 25 ms when
     * force switching mode */
    ztimer_spin(ZTIMER_MSEC, 25);
}

static void _usbdev_init(usbdev_t *dev)
{
    esp32_usb_otg_fshs_t *usbdev = (esp32_usb_otg_fshs_t *)dev;
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;

    usb_phy_handle_t phy_hdl;               /* only needed temporarily */

    usb_phy_config_t phy_conf = {
        .controller = USB_PHY_CTRL_OTG,
        .otg_mode = USB_OTG_MODE_DEVICE,
        .target = USB_PHY_TARGET_INT,       /* only internal PHY supported */
    };

