RIOT-OS/RIOT/cpu/esp32/periph/usbdev.c
    (void)enable;

    if (ep->dir == USB_EP_DIR_IN) {
        /* Disable first */
        _ep_in_disable(conf, ep->num);
        _in_regs(conf, ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
    }
    else {
        /* Disable first */
        _ep_out_disable(conf, ep->num);
        _out_regs(conf, ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
    }
}

static int _usbdev_ep_set(usbdev_ep_t *ep, usbopt_ep_t opt,
                          const void *value, size_t value_len)
{
    (void)value_len;
    int res = -ENOTSUP;
    switch (opt) {
        case USBOPT_EP_ENABLE:
            assert(value_len == sizeof(usbopt_enable_t));
            if (*((usbopt_enable_t *)value)) {
                _ep_activate(ep);
            }
            else {
                _ep_deactivate(ep);
            }
            res = sizeof(usbopt_enable_t);
            break;
        case USBOPT_EP_STALL:
            assert(value_len == sizeof(usbopt_enable_t));
            _ep_set_stall(ep, *(usbopt_enable_t *)value);
            res = sizeof(usbopt_enable_t);
            break;
        default:
            DEBUG("usbdev: Unhandled endpoint set call: 0x%x\n", opt);
            break;
    }
    return res;
}

static int _usbdev_ep_xmit(usbdev_ep_t *ep, uint8_t *buf, size_t len)
{
    esp32_usb_otg_fshs_t *usbdev = (esp32_usb_otg_fshs_t *)ep->dev;
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;

    /* Assert the alignment required for the buffers if DMA is used */
    if (_uses_dma(conf)) {
        assert(HAS_ALIGNMENT_OF(buf, USBDEV_CPU_DMA_ALIGNMENT));
    }

    DEBUG("usbdev: transfer %d byte on EP%u-%s @%u\n",
          len, ep->num, ep->dir == USB_EP_DIR_IN ? "IN" : "OUT", ztimer_now(ZTIMER_MSEC));

    if (ep->dir == USB_EP_DIR_IN) {
        /* Abort when the endpoint is not active, prevents hangs,
         * could be an assert in the future maybe */
        if (!(_in_regs(conf, ep->num)->DIEPCTL & USB_OTG_DIEPCTL_USBAEP)) {
            return -1;
        }

        if (_uses_dma(conf)) {
            _in_regs(conf, ep->num)->DIEPDMA = (uint32_t)(intptr_t)buf;
        }

        /* The order here is crucial (AFAIK), it is required to first set the
         * size and the packet count, then clear the NAK and enable the
         * endpoint, and finally fill the transmit FIFO with the packet data.
         * When DMA is enabled, filling the transmit FIFO is handled by the DMA
         * controller in the peripheral
         */

        /* Packet count seems not to decrement below 1 and thus is broken in
         * combination with the TXFE irq, it does however work with control
         * transfers and when using DMA */
        uint32_t dieptsiz = (len & USB_OTG_DIEPTSIZ_XFRSIZ_Msk);
        if (ep->num == 0 || _uses_dma(conf)) {
            dieptsiz |= (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos);
        }
        _in_regs(conf, ep->num)->DIEPTSIZ = dieptsiz;

        /* Intentionally enabling this before the FIFO is filled, unmasking the
         * interrupts after the FIFO is filled doesn't always trigger the ISR */
        /* TX FIFO empty interrupt is only used in non-dma mode */
        _device_regs(conf)->DAINTMSK |= 1 << ep->num;
        _device_regs(conf)->DIEPEMPMSK |= 1 << ep->num;

        _in_regs(conf, ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK |
                                            USB_OTG_DIEPCTL_EPENA;

        if (len > 0 && !_uses_dma(conf)) {
            /* The FIFO requires 32 bit word reads/writes */
            size_t words = (len + 3) / 4;

            /* buffer alignment is asserted above. Use intermediate
             * cast to uintptr_t to silence -Wcast-align*/
            uint32_t *ep_buf = (uint32_t *)(uintptr_t)buf;
            __O uint32_t *fifo = _tx_fifo(conf, ep->num);
            for (size_t i = 0; i < words; i++) {
                fifo[i] = ep_buf[i];
            }
        }
    }
    else {
        /* Abort when the endpoint is not active, prevents hangs,
         * could be an assert in the future maybe */
        if (!(_out_regs(conf, ep->num)->DOEPCTL & USB_OTG_DOEPCTL_USBAEP)) {
            return -1;
        }

        if (_uses_dma(conf)) {
            _out_regs(conf, ep->num)->DOEPDMA = (uint32_t)(intptr_t)buf;
        }
        else {
            container_of(ep, esp32_usb_otg_fshs_out_ep_t, ep)->out_buf = buf;
        }

        /* Configure to receive one packet with ep->len as max length */
        uint32_t doeptsiz = (1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |
                            (ep->len & USB_OTG_DOEPTSIZ_XFRSIZ_Msk);
        doeptsiz |= (ep->num == 0) ? 3 << USB_OTG_DOEPTSIZ_STUPCNT_Pos : 0;
        _out_regs(conf, ep->num)->DOEPTSIZ = doeptsiz;
        _out_regs(conf, ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK |
                                             USB_OTG_DOEPCTL_EPENA |
                                             _type_to_reg(ep->type);
    }

    return 0;
}

static void _copy_rxfifo(esp32_usb_otg_fshs_t *usbdev, uint8_t *buf, size_t len)
{
    /* The FIFO requires 32 bit word reads/writes. This is only called with
     * usbdev_ep_t::buf, which is aligned to four bytes in _usbdev_new_ep() */
    uint32_t *buf32 = (uint32_t *)(uintptr_t)buf;
    __I uint32_t *fifo32 = _rx_fifo(usbdev->config);
    size_t count = (len + 3) / 4;

    for (size_t i = 0; i < count; i++) {
        buf32[i] = fifo32[i];
    }
}

static void _read_packet(esp32_usb_otg_fshs_out_ep_t *esp_ep)
{
    esp32_usb_otg_fshs_t *usbdev = (esp32_usb_otg_fshs_t *)esp_ep->ep.dev;
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;
    /* Pop status from the receive fifo status register */
    uint32_t status = _global_regs(conf)->GRXSTSP;

    /* Packet status code */
    unsigned pkt_status = (status & USB_OTG_GRXSTSP_PKTSTS_Msk) >>
                          USB_OTG_GRXSTSP_PKTSTS_Pos;
    size_t len = (status & USB_OTG_GRXSTSP_BCNT_Msk) >>
                 USB_OTG_GRXSTSP_BCNT_Pos;

    /* Packet is copied on the update status and copied on the transfer
     * complete status*/
    if (pkt_status == ESP32_PKTSTS_DATA_UPDT ||
        pkt_status == ESP32_PKTSTS_SETUP_UPDT) {
        DEBUG("I %s %d\n", pkt_status == ESP32_PKTSTS_SETUP_UPDT ? "STUP_UPD" : "DATA_UPD", len);
        _copy_rxfifo(usbdev, esp_ep->out_buf, len);
#ifdef ESP32_USB_OTG_CID_2x
        /* CID 2x doesn't signal SETUP_COMP on non-zero length packets, signal
         * the TR_COMPLETE event immediately */
        if (esp_ep->ep.num == 0 && len) {
            usbdev->usbdev.epcb(&esp_ep->ep, USBDEV_EVENT_TR_COMPLETE);
        }
#endif  /* ESP32_USB_OTG_CID_2x */
    }
    /* On zero length frames, only the COMP status is signalled and the UPDT
     * status is skipped */
    else if (pkt_status == ESP32_PKTSTS_XFER_COMP) {
        DEBUG("I XFER_CPL %d\n", len);
        usbdev->usbdev.epcb(&esp_ep->ep, USBDEV_EVENT_TR_COMPLETE);
    }
    else if (pkt_status == ESP32_PKTSTS_SETUP_COMP) {
        DEBUG("I STUP_CPL %d\n", len);
#ifndef ESP32_USB_OTG_CID_2x
        usbdev->usbdev.epcb(&esp_ep->ep, USBDEV_EVENT_TR_COMPLETE);
#endif  /* ESP32_USB_OTG_CID_2x */
    }
}

/* This signals to the upper stack a completed transfer. Control transfers
 * behave slightly different with the interrupts, so a number of conditionals
 * filter interrupts to events
 */
static void _usbdev_ep_esr(usbdev_ep_t *ep)
{
    esp32_usb_otg_fshs_t *usbdev = (esp32_usb_otg_fshs_t *)ep->dev;
    const esp32_usb_otg_fshs_config_t *conf = usbdev->config;

